Revit 2027 API
Element.GetTypeId Method
 Returns the identifier of this element's type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetTypeId()
Public Function GetTypeId As ElementId
public:
ElementId^ GetTypeId()
member GetTypeId : unit -> ElementId
Return Value
ElementId
 The id of the element's type, or invalid element id if the element cannot have type assigned.
Remarks
 Some elements cannot have type assigned, in which case this method returns invalid element id.
Example
void GetStairType(Autodesk.Revit.DB.Document document)
{
   FilteredElementCollector collector = new FilteredElementCollector(document);
   ICollection<Element> stairs = collector.OfClass(typeof(FamilyInstance)).OfCategory(BuiltInCategory.OST_Stairs).ToElements();
   foreach (Element stair in stairs)
    {
        if (null == stair.GetTypeId())
        {
            TaskDialog.Show("Revit","No symbol found in stair element: " + stair.Name);
        }
        else
        {
            Element elemType = document.GetElement(stair.GetTypeId());
            string info = "Stair type is: " + elemType.Name;
            TaskDialog.Show("Revit",info);
        }
    }
}
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace